insert into books(title, price, amount)
values ("Мастер и Маргарита", 670.99, 3),
       ("Белая гвардия", 540.50, 5),
       ("Идиот", 460.00, 10),
       ("Братья Карамазовы", 799.01, 3),
       ("Игрок", 480.50, 10),
       ("Стихотворения и поэмы", 650.00, 15),
       ("Черный человек", 570.20, 6),
       ("Лирика", 518.99, 2),
       ("12 Стульев", 999.99, 12);

insert into authors(author_name)
values ("Булгаков М.А."),
       ("Достоевский Ф.М."),
       ("Есенин С.А."),
       ("Пастернак Б.Л."),
       ("Лермонтов М.Ю."),
       ("Ильф И.А."),
       ("Петров Е.П.");

insert into genres(genre_name)
values ("Роман"),
       ("Поэзий"),
       ("Приключения"),
       ("Сатира");

insert into book_author(book_id, author_id)
values (1, 1),
       (2, 1),
       (3, 2),
       (4, 2),
       (5, 3),
       (6, 3),
       (7, 4),
       (8, 2),
       (9, 6),
       (9, 7);

insert into book_genre(book_id, genre_id)
values (1, 1),
       (2, 1),
       (3, 1),
       (4, 1),
       (5, 2),
       (6, 2),
       (7, 2),
       (8, 1),
       (9, 1),
       (9, 3),
       (9, 4);